In [17]:
import pandas as pd

# Series

Creazione di una serie in Pandas:

In [18]:
s = pd.Series([5,6,12,1.3], index = ['A','B','C','D'], name = 'serie_0')
print(s)

A     5.0
B     6.0
C    12.0
D     1.3
Name: serie_0, dtype: float64

Accesso ad una series:

In [19]:
print(s[:2])

A    5.0
B    6.0
Name: serie_0, dtype: float64

# Dataframe

Creazione di un dataframe:

In [20]:
ds=pd.DataFrame({'foo':[0., 4., 8., -12.,16],
                 'bar':['x', 'y', 'z', 'w','a']
                 },
                index=['A','B','C','D','E'])
print(ds)

    foo bar
A   0.0   x
B   4.0   y
C   8.0   z
D -12.0   w
E  16.0   a


Hands-on excercise (slide 29)

Can you guess what if the output of
* pd.DataFrame({'foo':[1,2,6],'fee':[3,4,5]})
* pd.DataFrame({'foo':{'a':1,'b':1},'fee':{'c':1,'d':2}}

In [21]:
pd.DataFrame({'foo':[1,2,6],'fee':[3,4,5]})
pd.DataFrame({'foo':{'a':1,'b':1},'fee':{'c':1,'d':2}})

   foo  fee
a  1.0  NaN
b  1.0  NaN
c  NaN  1.0
d  NaN  2.0

Importazione di un CSV in un dataframe e stampa dei primi 5 record:

In [22]:
df = pd.read_csv("https://raw.githubusercontent.com/Apress/data-analysis-and-visualization-using-python/master/Ch07/Salaries.csv")
df.head(5)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [23]:
df_salary = df[['salary']]
ts_std = (df_salary - df_salary.mean()) / df_salary.std()
print(ts_std)

      salary
0   2.789891
1  -0.530995
2   0.088049
3   0.819308
4  -0.113940
..       ...
73 -0.090967
74 -0.123059
75  0.575684
76  0.068221
77  0.057335

[78 rows x 1 columns]

Visualizzare tipo di dato da un dataframe

In [24]:
df['salary'].dtype
df.dtypes
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

## Hands on SALARIES
Accesso agli attributi di un dataframe (esercizio slide 35):

In [25]:
print('Number of records:')
print(df.shape)

print('Number of total cells:')
print(df.size)

print('Column names:')
print(df.columns)

print('Column types:')
print(df.dtypes)

Number of records:
(78, 6)
Number of total cells:
468
Column names:
Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')
Column types:
rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

Count occurrences of unique records in a df with `value_counts()`

In [26]:
print(f'The represented disciplines are')
df['discipline'].value_counts()

The represented disciplines are

discipline
B    42
A    36
Name: count, dtype: int64

In [27]:
print('How many unique discipline values appear in the dataframe?\n')
df['discipline'].value_counts()

How many unique discipline values appear in the dataframe?

discipline
B    42
A    36
Name: count, dtype: int64

In [28]:
print('How many records are associated with unique discipline values?\n')

How many records are associated with unique discipline values?

## Hands on SALARIES

Accesso ai metodi di un dataframe (esercizio slide 37):

In [29]:
numeric_columns=['phd','service','salary']
numeric_df = df.select_dtypes(include=['number'])
print('Summary of numeric columns:')
print(numeric_df.sum())
print('Standard deviations of numeric colums:')
print(numeric_df.std())
print('Mean values of the first 50 records:')
print(numeric_df.head(50).mean())

Summary of numeric columns:
phd           1537
service       1174
salary     8425855
dtype: int64
Standard deviations of numeric colums:
phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64
Mean values of the first 50 records:
phd            21.52
service        17.60
salary     113789.14
dtype: float64

Lista di tutti i metodi

In [30]:
dir(df)[226:]

['_stat_function_ddof',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'discipline',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isetitem',
 'isin',
 'isna',
 'isnull',
 'items',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'phd',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'salary',
 'sample',
 'select_dtypes',
 'sem',
 'service',
 'set_axis',
 'set_flags',
 'set_index',
 'sex',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_orc',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

### comprehensive summary of df infos

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [32]:
print("count how many nan values appear in each column of the df")
df.isna().sum()

count how many nan values appear in each column of the df

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [33]:
print("sample 3 elements from a df\n")
print(df.sample(3))

print("\nsample a fraction of elements in the df\n")
# 0.1 significa che si prende il 10% delle righe originali 
df.sample(frac=0.1)

sample 3 elements from a df

        rank discipline  phd  service     sex  salary
9       Prof          A   51       51    Male   57800
68  AsstProf          A    4        2  Female   77500
76      Prof          A   28       14  Female  109954

sample a fraction of elements in the df

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
15       Prof          B   17        3    Male  150480
53   AsstProf          A    5        3  Female   73500
59  AssocProf          B   12       10  Female  103994
42   AsstProf          B    4        2  Female   80225
8        Prof          A   29       19    Male   94350
34  AssocProf          B   12        8    Male  119800
50   AsstProf          B   10        5  Female   97032

# Processing tables using pandas

## Selection/Slicing:

In [34]:
# Selecting one column by it's name
print(df['sex'].value_counts(),end='\n\n')

# Selecting multiple columns by their name
print(df[['sex','salary']].head())
# Selection rows by their index position
print(f'\n{df[0:5]}') # equivalente a fare head()

sex
Male      39
Female    39
Name: count, dtype: int64

    sex  salary
0  Male  186960
1  Male   93000
2  Male  110515
3  Male  131205
4  Male  104800

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

Possiamo creare dei sottoinsieme di dataframe usando un **Boolean Indexing**, quest'ultimo ritornerà T o F e potremo usarli come filtri per l'indicizzazione.

In [45]:
df_subset = df.head()
df_subset['salary'] > 120000

0     True
1    False
2    False
3     True
4    False
Name: salary, dtype: bool

Esempio di filtraggio con Boolean Indexing:

In [49]:
print('select only rows with salaries larger than 120000 euros\n\n')
filtro = df['salary'] > 120000
print(f'Tipo filtro: {type(filtro)}', end='\n\n')
df_sub=df[filtro].head()
print(df_sub)

select only rows with salaries larger than 120000 euros


Tipo filtro: <class 'pandas.core.series.Series'>

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250

Possiamo anche utlizzare i comparatori Booleani per creare filtri più specifici:

In [50]:
female_filter = df['sex'] == 'Female'
df_female = df[female_filter]
df_female.head()

# modalità compatta:
df_f = df[ df['sex'] == 'Female']
df_f.head()

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000

HANDS ON: Slicing/filtering (esercizio slide 41:)

* Calculate the basic statistics for the salary column;
* Find how many values in the salary column (use count_values method);
* Calculate the average salary
* Select the female professors with a salary greater than 120000
* Select the salary column of female professors

In [38]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [39]:
print('Basic statistics of the salary column')
print(df['salary'].describe())

print('\n\nThe number of records in the salary column is ')
print(df['salary'].count())

print('\n\nThe average salary is ')
print(df['salary'].mean())

print('\n\nRecords related to female professor with a salary larger than 120k')

df_f_salary120 = df[(df['sex'] == 'Female') & (df['salary'] > 120000)]
print(df_f_salary120.head(1))

print(f'Female professors with salary over 120: {len(df_f_salary120)}')
print('\n\nSalary column of female professors')
print(df[df['sex'] == 'Female'][['salary','sex']].head(1))
print(df[df['sex'] == 'Female']['salary'].head(1))

Basic statistics of the salary column
count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64


The number of records in the salary column is
78


The average salary is
108023.78205128205


Records related to female professor with a salary larger than 120k
    rank discipline  phd  service     sex  salary
39  Prof          B   18       18  Female  129000
Female professors with salary over 120: 9


Salary column of female professors
    salary     sex
39  129000  Female
39    129000
Name: salary, dtype: int64

In [54]:
print('\n\nRecords related to female professor with a salary larger than 120k')
female_120 = df[ (df['salary'] > 120000) & (df['sex'] == 'Female')]
print(female_120.head(5))
print(f'Female professors with salary over 120')
print(female_120['rank'].count()) # or len(female_120)
print('\n\nSalary column of female professors')
print(df[ df['sex'] == 'Female']['salary'])

Records related to female professor with a salary larger than 120k
    rank discipline  phd  service     sex  salary
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
Female professors with salary over 120
9


Salary column of female professors
39    129000
40    137000
41     74830
42     80225
43     77000
44    151768
45    140096
46     74692
47    103613
48    111512
49    122960
50     97032
51    127512
52    105000
53     73500
54     62884
55     72500
56     77500
57     72500
58    144651
59    103994
60     92000
61    103750
62    109650
63     91000
64     73300
65    117555
66     63100
67     90450
68     77500
69    116450
70     78500
71     71065
72    161101
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, dtype: int64

## iloc and loc methods

In [40]:
print('Slicing a dataframe using loc')
df.loc[30:40,['rank','service','salary']]

Slicing a dataframe using loc

         rank  service  salary
30  AssocProf        7  107008
31       Prof       21  155750
32       Prof       19  103275
33       Prof       18  120000
34  AssocProf        8  119800
35       Prof       23  126933
36       Prof       45  146856
37       Prof        8  102000
38   AsstProf        3   91000
39       Prof       18  129000
40       Prof       36  137000

In [41]:
print('Sub dataframe in question')
df_sub=df[df['salary']>120000]
print(df_sub.head(5))

print('\n\nLet us apply loc to a sub dataframe:')
print('Note that loc slicing refers only to index values! It is not linked to row positions in the dataframe! \n')
print(df_sub.loc[10:20,['rank','salary']]) ##note that the first entry in the loc method refers to the index values

Sub dataframe in question
    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250


Let us apply loc to a sub dataframe:
Note that loc slicing refers only to index values! It is not linked to row positions in the dataframe!

    rank  salary
10  Prof  128250
11  Prof  134778
13  Prof  162200
14  Prof  153750
15  Prof  150480
19  Prof  150500

In [42]:
print('Let us now apply iloc slicing to the dataframe')
print(df.iloc[:3,[0,1,2 ]])

print('\nAs in the df the index values are increasing and continuous integer number, \nthe result is equivalent to what we would obtain using the loc method')

Let us now apply iloc slicing to the dataframe
   rank discipline  phd
0  Prof          B   56
1  Prof          A   12
2  Prof          A   23

As in the df the index values are increasing and continuous integer number,
the result is equivalent to what we would obtain using the loc method

In [43]:
print('Let us now apply iloc on sub_df')

print(df_sub.iloc[10:30,[0,1,2]])

print('\nnote that the first entry in the iloc method refers to the record position, not to the index!')

Let us now apply iloc on sub_df
    rank discipline  phd
26  Prof          A   38
27  Prof          A   45
29  Prof          B   21
31  Prof          B   22
35  Prof          B   28
36  Prof          B   45
39  Prof          B   18
40  Prof          A   39
44  Prof          B   23
45  Prof          B   25
49  Prof          B   17
51  Prof          B   20
58  Prof          B   36
72  Prof          B   24
75  Prof          B   17

note that the first entry in the iloc method refers to the record position, not to the index!

## Aggregate:

In [ ]:
numeric_columns=['phd','service','salary']

print('print sum of colum values per row\n')
print(df[numeric_columns].sum(axis=1, skipna=True),'\n')
print('print the average column values\n')
print(df[numeric_columns].mean(),'\n')
print('Print the standard deviation of the salary column values\n')
df_s=df[['salary']]
print(df_s.std())
print('Print the standardized salary using zscore formula (value-mean)/std:\n')
ts_stand=(df_s-df_s.mean())/df_s.std()
print(ts_stand)
print('Add the standardized salary to df:\n')
df['std-salary']=ts_stand
df.head()

print sum of colum values per row

0     187065
1      93018
2     110558
3     131276
4     104838
       ...
73    105478
74    104567
75    124346
76    109996
77    109684
Length: 78, dtype: int64

print the average column values

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

Print the standard deviation of the salary column values

salary    28293.661022
dtype: float64
Print the standardized salary using zscore formula (value-mean)/std:

      salary
0   2.789891
1  -0.530995
2   0.088049
3   0.819308
4  -0.113940
..       ...
73 -0.090967
74 -0.123059
75  0.575684
76  0.068221
77  0.057335

[78 rows x 1 columns]
Add the standardized salary to df:

   rank discipline  phd  service   sex  salary  std-salary
0  Prof          B   56       49  Male  186960    2.789891
1  Prof          A   12        6  Male   93000   -0.530995
2  Prof          A   23       20  Male  110515    0.088049
3  Prof          A   40       31  Male  131205    0.819308
4  Prof          B   20       18  Male  104800   -0.113940

In [ ]:
print('Print some selected statistics (sum,min,prod) on the salary column')

df['salary'].agg(['sum','min','prod'])

Print some selected statistics (sum,min,prod) on the salary column

sum     8425855
min       57800
prod          0
Name: salary, dtype: int64

## Map:

In [ ]:
print('The sex column entries exhibit capital letters.')
print(df['sex'].head())
print('Format the column so that no capital letter appears.')
df['sex']=df['sex'].str.lower()
print(df['sex'].head())

The sex column entries exhibit capital letters.
0    Male
1    Male
2    Male
3    Male
4    Male
Name: sex, dtype: object
Format the column so that no capital letter appears.
0    male
1    male
2    male
3    male
4    male
Name: sex, dtype: object

In [ ]:
def dollarConvert(x):
  return x*1.07

print('define a function converting salary values form euros to dollars')
df['dollar']=df['salary'].map(dollarConvert)
df

define a function converting salary values form euros to dollars

         rank discipline  phd  service     sex  salary  std-salary     dollar
0        Prof          B   56       49    male  186960    2.789891  200047.20
1        Prof          A   12        6    male   93000   -0.530995   99510.00
2        Prof          A   23       20    male  110515    0.088049  118251.05
3        Prof          A   40       31    male  131205    0.819308  140389.35
4        Prof          B   20       18    male  104800   -0.113940  112136.00
..        ...        ...  ...      ...     ...     ...         ...        ...
73       Prof          B   18       10  female  105450   -0.090967  112831.50
74  AssocProf          B   19        6  female  104542   -0.123059  111859.94
75       Prof          B   17       17  female  124312    0.575684  133013.84
76       Prof          A   28       14  female  109954    0.068221  117650.78
77       Prof          A   23       15  female  109646    0.057335  117321.22

[78 rows x 8 columns]

## Group-by:

In [ ]:
print('let us now group df records by rank')
df_rank=df.groupby(['rank'])
print('The groups obtained correspond to unique rank values\n')
print(df_rank.groups)
print('\nAfter grouping we can compute aggregate measures on each group. \nLet us compute the mean values on numerical column.\n')
numeric_cols=df.columns[df.dtypes.isin(['int64','float64'])]
print(df_rank[numeric_cols].mean())

let us now group df records by rank
The groups obtained correspond to unique rank values

{'AssocProf': [6, 30, 34, 41, 47, 54, 56, 59, 61, 62, 64, 71, 74], 'AsstProf': [12, 16, 17, 20, 22, 23, 28, 38, 42, 43, 46, 50, 53, 55, 57, 60, 66, 68, 70], 'Prof': [0, 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 13, 14, 15, 18, 19, 21, 24, 25, 26, 27, 29, 31, 32, 33, 35, 36, 37, 39, 40, 44, 45, 48, 49, 51, 52, 58, 63, 65, 67, 69, 72, 73, 75, 76, 77]}

After grouping we can compute aggregate measures on each group.
Let us compute the mean values on numerical column.

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

## Concat:

In [ ]:
print('Let us now introduce df1, a new dataframe with few records')
df1=pd.DataFrame({'rank':['AssocProf','Prof','AsstProf'],'salary':[91786.23,123624.80,81362.78]})
print(df1)


print('\n\nUse default concatenation of df and df1:')
df_u=pd.concat([df,df1])
print(df_u)
print('Mind that indices keep their original values! It would be better to reinitialize the index.')
print(df_u.reset_index(drop=True))


print('\n\nWhat happens if we concatenate columns and use inner join?')
df_j=pd.concat([df,df1],axis=1,join='inner')
print(df_j)
print('It searches for records having the same index values and concatenates them.\n Columns with the same name but different entries are duplicated.')

Let us now introduce df1, a new dataframe with few records
        rank     salary
0  AssocProf   91786.23
1       Prof  123624.80
2   AsstProf   81362.78


Use default concatenation of df and df1:
         rank discipline   phd  service     sex     salary  std-salary  \
0        Prof          B  56.0     49.0    male  186960.00    2.789891
1        Prof          A  12.0      6.0    male   93000.00   -0.530995
2        Prof          A  23.0     20.0    male  110515.00    0.088049
3        Prof          A  40.0     31.0    male  131205.00    0.819308
4        Prof          B  20.0     18.0    male  104800.00   -0.113940
..        ...        ...   ...      ...     ...        ...         ...
76       Prof          A  28.0     14.0  female  109954.00    0.068221
77       Prof          A  23.0     15.0  female  109646.00    0.057335
0   AssocProf        NaN   NaN      NaN     NaN   91786.23         NaN
1        Prof        NaN   NaN      NaN     NaN  123624.80         NaN
2    AsstProf        NaN   NaN      NaN     NaN   81362.78         NaN

       dollar
0   200047.20
1    99510.00
2   118251.05
3   140389.35
4   112136.00
..        ...
76  117650.78
77  117321.22
0         NaN
1         NaN
2         NaN

[81 rows x 8 columns]
Mind that indices keep their original values! It would be better to reinitialize the index.
         rank discipline   phd  service     sex     salary  std-salary  \
0        Prof          B  56.0     49.0    male  186960.00    2.789891
1        Prof          A  12.0      6.0    male   93000.00   -0.530995
2        Prof          A  23.0     20.0    male  110515.00    0.088049
3        Prof          A  40.0     31.0    male  131205.00    0.819308
4        Prof          B  20.0     18.0    male  104800.00   -0.113940
..        ...        ...   ...      ...     ...        ...         ...
76       Prof          A  28.0     14.0  female  109954.00    0.068221
77       Prof          A  23.0     15.0  female  109646.00    0.057335
78  AssocProf        NaN   NaN      NaN     NaN   91786.23         NaN
79       Prof        NaN   NaN      NaN     NaN  123624.80         NaN
80   AsstProf        NaN   NaN      NaN     NaN   81362.78         NaN

       dollar
0   200047.20
1    99510.00
2   118251.05
3   140389.35
4   112136.00
..        ...
76  117650.78
77  117321.22
78        NaN
79        NaN
80        NaN

[81 rows x 8 columns]


What happens if we concatenate columns and use inner join?
   rank discipline  phd  service   sex  salary  std-salary     dollar  \
0  Prof          B   56       49  male  186960    2.789891  200047.20
1  Prof          A   12        6  male   93000   -0.530995   99510.00
2  Prof          A   23       20  male  110515    0.088049  118251.05

        rank     salary
0  AssocProf   91786.23
1       Prof  123624.80
2   AsstProf   81362.78
It searches for records having the same index values and concatenates them.
 Columns with the same name but different entries are duplicated.

## Merge:

In [ ]:
df2=pd.DataFrame({'discipline':['A','B'], 'description':['computer science','math']})
df_d=pd.merge(df,df2)
df_d

,rank,discipline,phd,service,sex,salary,std-salary,dollar,description
0,Prof,B,56,49,male,186960,2.789891,200047.20,math
1,Prof,A,12,6,male,93000,-0.530995,99510.00,computer science
2,Prof,A,23,20,male,110515,0.088049,118251.05,computer science
3,Prof,A,40,31,male,131205,0.819308,140389.35,computer science
4,Prof,B,20,18,male,104800,-0.113940,112136.00,math
...,...,...,...,...,...,...,...,...,...
73,Prof,B,18,10,female,105450,-0.090967,112831.50,math
74,AssocProf,B,19,6,female,104542,-0.123059,111859.94,math
75,Prof,B,17,17,female,124312,0.575684,133013.84,math
76,Prof,A,28,14,female,109954,0.068221,117650.78,computer science
77,Prof,A,23,15,female,109646,0.057335,117321.22,computer science

### Sorting:

In [ ]:
print("Sort values by service")
df_sorted=df.sort_values(by=['service'])
print(df_sorted.head())

print("Sort values by discipline and service")
df_double_sorted=df.sort_values(by=['discipline','service'])
print(df_double_sorted.head())

Sort values by service
        rank discipline  phd  service     sex  salary  std-salary   dollar
55  AsstProf          A    2        0  female   72500   -1.255539  77575.0
23  AsstProf          A    2        0    male   85000   -0.813743  90950.0
43  AsstProf          B    5        0  female   77000   -1.096492  82390.0
17  AsstProf          B    4        0    male   92000   -0.566338  98440.0
12  AsstProf          B    1        0    male   88000   -0.707713  94160.0
Sort values by discipline and service
        rank discipline  phd  service     sex  salary  std-salary    dollar
23  AsstProf          A    2        0    male   85000   -0.813743   90950.0
52      Prof          A   12        0  female  105000   -0.106871  112350.0
55  AsstProf          A    2        0  female   72500   -1.255539   77575.0
57  AsstProf          A    3        1  female   72500   -1.255539   77575.0
22  AsstProf          A    4        2    male   73000   -1.237867   78110.0

### Hands on SALARIES (slide 53)

*  Given the dataset df_2 defined below, merge df and df_2 keeping record union (outer).

*  How many nans in the dataset?

*  Drop rows containing nan values

*  Sort values according to discipline and Dept

*  Compute the average distribution of Females anf Males in the three Departments.

In [ ]:
import numpy as np
import random
r=random.randint(20,70)
dept=np.random.choice(['Math','CS','Phys'],r)
df_2=df[['rank','phd','salary']].sample(r).copy()
df_2['Dept']=dept
df_2

         rank  phd  salary  Dept
55   AsstProf    2   72500  Phys
43   AsstProf    5   77000  Math
71  AssocProf   12   71065    CS
50   AsstProf   10   97032  Phys
42   AsstProf    4   80225  Phys
..        ...  ...     ...   ...
62  AssocProf   14  109650    CS
63       Prof   29   91000  Math
18       Prof   19  107300  Phys
17   AsstProf    4   92000  Phys
5        Prof   20  122400  Phys

[67 rows x 4 columns]

In [ ]:
print('merged dataset using outher method')

print('Count the number of nans per column')

print('Drop rows containing nan values')

print('sort values by discipline and Dept values')

print('Compute the number of males and females per department')

merged dataset using outher method
Count the number of nans per column
Drop rows containing nan values
sort values by discipline and Dept values
Compute the number of males and females per department

# Other meaningful examples of map method

In [ ]:
print('How can we map a colum containing lists of fixed lenght into multiple columns?')

data = pd.DataFrame({'Patient':['A','B','C'],
    'measurements': [
        [10, 20, 30, 40, 50],
        [15, 25, 35, 45, 55],
        [12, 22, 32, 42, 52]
    ]
})
print('\nOriginal Data')
print(data)

def map_list(lst):
    return pd.Series(lst)


new_columns=data['measurements'].apply(map_list)
new_columns.columns=[f'measure_{i}' for i in range(1,new_columns.shape[1]+1)]
print('\nNew Columns')
print(new_columns)


data=pd.concat([data[['Patient']],new_columns],axis=1)
print('\nNew Data')
print(data)

How can we map a colum containing lists of fixed lenght into multiple columns?

Original Data
  Patient          measurements
0       A  [10, 20, 30, 40, 50]
1       B  [15, 25, 35, 45, 55]
2       C  [12, 22, 32, 42, 52]

New Columns
   measure_1  measure_2  measure_3  measure_4  measure_5
0         10         20         30         40         50
1         15         25         35         45         55
2         12         22         32         42         52

New Data
  Patient  measure_1  measure_2  measure_3  measure_4  measure_5
0       A         10         20         30         40         50
1       B         15         25         35         45         55
2       C         12         22         32         42         52

In [ ]:
# Example DataFrame with a column containing lists of various lengths
data = pd.DataFrame({'Patient':['A','B','C','D','E'],
    'measurements': [
        [10, 20, 30, 40, 50],
        [15, 25],
        [12, 22, 32],
        [8],
        []
    ]
})


new_columns=data['measurements'].apply(map_list)
new_columns.columns=[f'measure_{i}' for i in range(1,new_columns.shape[1]+1)]
print('\nNew Columns')
print(new_columns)


data=pd.concat([data[['Patient']],new_columns],axis=1)
print('\nNew Data')
print(data)

New Columns
   measure_1  measure_2  measure_3  measure_4  measure_5
0       10.0       20.0       30.0       40.0       50.0
1       15.0       25.0        NaN        NaN        NaN
2       12.0       22.0       32.0        NaN        NaN
3        8.0        NaN        NaN        NaN        NaN
4        NaN        NaN        NaN        NaN        NaN

New Data
  Patient  measure_1  measure_2  measure_3  measure_4  measure_5
0       A       10.0       20.0       30.0       40.0       50.0
1       B       15.0       25.0        NaN        NaN        NaN
2       C       12.0       22.0       32.0        NaN        NaN
3       D        8.0        NaN        NaN        NaN        NaN
4       E        NaN        NaN        NaN        NaN        NaN

# Data from Kaggle

Use Kaggle username and key

In [ ]:
!pip install kaggle

Requirement already satisfied: kaggle in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (1.7.4)
Requirement already satisfied: bleach in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (6.2.0)
Requirement already satisfied: certifi>=14.05.14 in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (2025.1.31)
Requirement already satisfied: charset-normalizer in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (3.4.1)
Requirement already satisfied: idna in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (3.10)
Requirement already satisfied: protobuf in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (6.30.0)
Requirement already satisfied: python-dateutil>=2.5.3 in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (2.9.0.post0)
Requirement already satisfied: python-slugify in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (8.0.4)
Requirement already satisfied: requests in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (2.32.3)
Requirement already satisfied: setuptools>=21.0.0 in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (76.0.0)
Requirement already satisfied: six>=1.10 in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (1.17.0)
Requirement already satisfied: text-unidecode in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (1.3)
Requirement already satisfied: tqdm in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (4.67.1)
Requirement already satisfied: urllib3>=1.15.1 in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (2.3.0)
Requirement already satisfied: webencodings in /Users/chris/.local/share/virtualenvs/Lab-YkoVauK0/lib/python3.13/site-packages (from kaggle) (0.5.1)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip install --upgrade pip

In [11]:
!kaggle datasets download -d fedesoriano/body-fat-prediction-dataset
##CHANGE PATH ACCORDING THE NOTEBOOK LOCATION
!unzip body-fat-prediction-dataset.zip

Protocol message DatasetInfo has no "info" field.
Archive:  body-fat-prediction-dataset.zip
  inflating: bodyfat.csv

In [12]:
##CHANGE PATH ACCORDING THE NOTEBOOK LOCATION
os.chdir('/Users/chris/Notes/masters/BigDataAnalytics/Lab/')

In [15]:
import pandas as pd
df=pd.read_csv('./bodyfat.csv') 
df.head(5)

,Density,BodyFat,Age,Weight,Height,Neck,Chest,Abdomen,Hip,Thigh,Knee,Ankle,Biceps,Forearm,Wrist
0,1.0708,12.3,23,154.25,67.75,36.2,93.1,85.2,94.5,59.0,37.3,21.9,32.0,27.4,17.1
1,1.0853,6.1,22,173.25,72.25,38.5,93.6,83.0,98.7,58.7,37.3,23.4,30.5,28.9,18.2
2,1.0414,25.3,22,154.00,66.25,34.0,95.8,87.9,99.2,59.6,38.9,24.0,28.8,25.2,16.6
3,1.0751,10.4,26,184.75,72.25,37.4,101.8,86.4,101.2,60.1,37.3,22.8,32.4,29.4,18.2
4,1.0340,28.7,24,184.25,71.25,34.4,97.3,100.0,101.9,63.2,42.2,24.0,32.2,27.7,17.7

The variables listed below, from left to right, are:

*   Density determined from underwater weighing
*   Percent body fat from Siri's (1956) equation
*   Age (years)
*   Weight (lbs)
*   Height (inches)
*   Neck circumference (cm)
*   Chest circumference (cm)
*   Abdomen 2 circumference (cm)
*   Hip circumference (cm)
*   Thigh circumference (cm)
*   Knee circumference (cm)
*   Ankle circumference (cm)
*   Biceps (extended) circumference (cm)
*   Forearm circumference (cm)
*   Wrist circumference (cm)

## Exercise

### 1) Print dataset basic properties
- Number of cells, rows, columns

### 2) Check data types

### 3) Compute summary statistics
- Is there something unusual? (Check, e.g., the Height column)
- Is that a real value or an error? (Filter patients to check)

### 4) Compute the average Density
- For patients with BodyFat > 0.25
- For patients with BodyFat < 0.2
- Is this an intuitive result?

### 5) Add a BMI column
BMI formula: $BMI = \frac{\text{Weight (kg)}}{\text{Height (m)}^2}$

- Add a column containing Weight in kg:  $ 1 \text{ lb} = 0.453 \text{ kg}$
- Add a column containing Height in meters: $ 1 \text{ inch} = 0.0254 \text{ m} $
- Add the BMI column to the df

### 6) Define categorical BMI classes
```python
 df['cBMI'] = pd.cut(df['BMI'], bins=[0,20,27,100], labels=['underweight','normal','overweight'])
```
- Group by `cBMI` and compute average statistics

#### COMPLETE THE EXERCISE

## PART 2 - Tidy Data dataset

#### HANDS-ON:

In [ ]:
import pandas as pd

print('import data from "https://raw.githubusercontent.com/nickhould/tidy-data-python/master/data/pew-raw.csv"\n')
print('check the content of the file\n')
print("Melt the data to get a tidy df\n")

import data from "https://raw.githubusercontent.com/nickhould/tidy-data-python/master/data/pew-raw.csv"

check the content of the file

Melt the data to get a tidy df

### Tidy Data 2: product sales data

Download the dataset and import it in your drive folder https://www.kaggle.com/datasets/ksabishek/product-sales-data

Inspect dataframe content and validate data types. Are they consistent? (spoiler alert, they are not). Use pd.to_datetime(df['Date'],dayfirst=True)to validate datetime data.

Melt the data so to reach a tidy dataset

In [ ]:
# download sales data
!kaggle datasets download -d ksabishek/product-sales-data

!unzip /content/drive/MyDrive/path/product-sales-data.zip ## change path

In [ ]:
# import and inspect content
# validate data types. Hint: pd.to_datetime(df['Date'],dayfirst=True)

In [ ]:
#melt the data to get a tidy dataset

In [ ]:
pd.options.mode.copy_on_write = True
df_sales=pd.read_csv('/content/drive/MyDrive/path/statsfinal.csv',index_col=0) ##change path
df_sales.head()

#### Using pd.wide_to_long

In [ ]:
import numpy as np

df = pd.DataFrame(
    {
        "A1970": {0: "a", 1: "b", 2: "c"},
        "A1980": {0: "d", 1: "e", 2: "f"},
        "B1970": {0: 2.5, 1: 1.2, 2: 0.7},
        "B1980": {0: 3.2, 1: 1.3, 2: 0.1},
        "X": dict(zip(range(3), np.random.randn(3))),
        "id": dict(zip(range(3), range(3))),
    }
)

print('Original dataset')
print(df)

wtl=pd.wide_to_long(df, stubnames=["A", "B"], i="id", j="year")
print('wide-to-long transformation')
print(wtl)

Original dataset
  A1970 A1980  B1970  B1980         X  id
0     a     d    2.5    3.2 -0.816032   0
1     b     e    1.2    1.3  0.043604   1
2     c     f    0.7    0.1 -1.522316   2
wide-to-long transformation
                X  A    B
id year
0  1970 -0.816032  a  2.5
1  1970  0.043604  b  1.2
2  1970 -1.522316  c  0.7
0  1980 -0.816032  d  3.2
1  1980  0.043604  e  1.3
2  1980 -1.522316  f  0.1

### Exercise:
Use the dataset from the previous exercise and make it tidy using the wide-to-long method

In [ ]:
## complete

### Stack and Unstack

In [ ]:
df_single_level_cols = pd.DataFrame([[0, 1], [2, 3]],
                                     index=['cat', 'dog'],
                                     columns=['weight', 'height'])

# Displaying original data
print("Original Data:")
print(df_single_level_cols)

print("\nStacked Data:")
stacked_data=df_single_level_cols.stack()
print(stacked_data)

print("\nUnstacked Back:")
unstacked_data=stacked_data.unstack(level=1)
print(unstacked_data)


print("\nif unstacking with wrong level:")
w_unstacked_data=stacked_data.unstack(level=0)
print(w_unstacked_data)

Original Data:
     weight  height
cat       0       1
dog       2       3

Stacked Data:
cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

Unstacked Back:
     weight  height
cat       0       1
dog       2       3

if unstacking with wrong level:
        cat  dog
weight    0    2
height    1    3

In [ ]:
##### HANDS-ON

import pandas as pd

##to set a column as the index use df.set_index('columns_to_become_index', inplace=True)

# Creating a DataFrame with sales data
data = pd.DataFrame({
    'Region': ['North', 'South', 'East', 'West'],
    'Product_A': [100, 150, 200, 250],
    'Product_B': [120, 160, 220, 280],
    'Product_C': [130, 170, 240, 300]
})

#Use stack and unstack it to get the results in slide 23

#### Further examples using map, stack and explode

In [ ]:
### Take the example from the map method cells
### maybe multiple rows would be better than multiple columns in this case
def map_list(lst):
    return pd.Series(lst)

# Example DataFrame with a column containing lists of various lengths
data = pd.DataFrame({'Patient':['A','B','C','D','E'],
    'measurements': [
        [10, 20, 30, 40, 50],
        [15, 25],
        [12, 22, 32],
        [8],
        []
    ]
})
print('Original data')
print(data)

new_columns=data['measurements'].apply(map_list)
print('\nNew Columns')
print(new_columns)


new_data=pd.concat([data[['Patient']],new_columns],axis=1)
print('\nNew Data')
print(new_data)

##make this dataset long using stack
new_data.set_index('Patient',inplace=True)
stacked_data=new_data.stack().reset_index()
print('\nNew stacked Data')
print(stacked_data)

# Much easier with df.explode that explodes the 'measurements' column into multiple rows
exploded_data = data.explode('measurements')

print('\nExploded Data')
print(exploded_data)

Original data
  Patient          measurements
0       A  [10, 20, 30, 40, 50]
1       B              [15, 25]
2       C          [12, 22, 32]
3       D                   [8]
4       E                    []

New Columns
      0     1     2     3     4
0  10.0  20.0  30.0  40.0  50.0
1  15.0  25.0   NaN   NaN   NaN
2  12.0  22.0  32.0   NaN   NaN
3   8.0   NaN   NaN   NaN   NaN
4   NaN   NaN   NaN   NaN   NaN

New Data
  Patient     0     1     2     3     4
0       A  10.0  20.0  30.0  40.0  50.0
1       B  15.0  25.0   NaN   NaN   NaN
2       C  12.0  22.0  32.0   NaN   NaN
3       D   8.0   NaN   NaN   NaN   NaN
4       E   NaN   NaN   NaN   NaN   NaN

New stacked Data
   Patient  level_1     0
0        A        0  10.0
1        A        1  20.0
2        A        2  30.0
3        A        3  40.0
4        A        4  50.0
5        B        0  15.0
6        B        1  25.0
7        C        0  12.0
8        C        1  22.0
9        C        2  32.0
10       D        0   8.0

Exploded Data
  Patient measurements
0       A           10
0       A           20
0       A           30
0       A           40
0       A           50
1       B           15
1       B           25
2       C           12
2       C           22
2       C           32
3       D            8
4       E          NaN

## Pivoting

In [ ]:
import numpy as np
data = {
    "value": np.random.randn(20),
    "variable": ["A"] * 10 + ["B"] * 10,
    "category": np.random.choice(["type1", "type2", "type3", "type4"], 20),
    "date": (
        list(pd.date_range("1/1/2000", periods=10, freq="M"))
        + list(pd.date_range("1/1/2000", periods=10, freq="M"))
    ),
}
df = pd.DataFrame(data, columns=["date", "variable", "category", "value"])
df.sort_values(by=['date'],inplace=True)


print('\nOriginal data')
print(df)

pivoted_df=df.pivot(index="date", columns="variable", values="value")
print('\nPivoted on single column')
print(pivoted_df)


pivoted2_df=df.pivot(index="date", columns=["category","variable"], values="value")
print('\nPivoted on two colums')
print(pivoted2_df)

Original data
         date variable category     value
0  2000-01-31        A    type4 -0.587419
10 2000-01-31        B    type3  2.430159
1  2000-02-29        A    type1  0.467901
11 2000-02-29        B    type2 -2.470781
2  2000-03-31        A    type3  0.298999
12 2000-03-31        B    type3 -0.255454
3  2000-04-30        A    type2 -0.145388
13 2000-04-30        B    type1 -1.113720
4  2000-05-31        A    type3  1.333355
14 2000-05-31        B    type3 -1.226735
5  2000-06-30        A    type3  0.070296
15 2000-06-30        B    type3 -2.022547
6  2000-07-31        A    type4  1.801242
16 2000-07-31        B    type2  1.774179
17 2000-08-31        B    type3  0.725221
7  2000-08-31        A    type2 -0.510035
18 2000-09-30        B    type1 -0.187762
8  2000-09-30        A    type4 -2.707613
9  2000-10-31        A    type1 -0.869790
19 2000-10-31        B    type1 -0.474619

Pivoted on single column
variable           A         B
date
2000-01-31 -0.587419  2.430159
2000-02-29  0.467901 -2.470781
2000-03-31  0.298999 -0.255454
2000-04-30 -0.145388 -1.113720
2000-05-31  1.333355 -1.226735
2000-06-30  0.070296 -2.022547
2000-07-31  1.801242  1.774179
2000-08-31 -0.510035  0.725221
2000-09-30 -2.707613 -0.187762
2000-10-31 -0.869790 -0.474619

Pivoted on two colums
category       type4     type3     type1     type2     type3     type2  \
variable           A         B         A         B         A         A
date
2000-01-31 -0.587419  2.430159       NaN       NaN       NaN       NaN
2000-02-29       NaN       NaN  0.467901 -2.470781       NaN       NaN
2000-03-31       NaN -0.255454       NaN       NaN  0.298999       NaN
2000-04-30       NaN       NaN       NaN       NaN       NaN -0.145388
2000-05-31       NaN -1.226735       NaN       NaN  1.333355       NaN
2000-06-30       NaN -2.022547       NaN       NaN  0.070296       NaN
2000-07-31  1.801242       NaN       NaN  1.774179       NaN       NaN
2000-08-31       NaN  0.725221       NaN       NaN       NaN -0.510035
2000-09-30 -2.707613       NaN       NaN       NaN       NaN       NaN
2000-10-31       NaN       NaN -0.869790       NaN       NaN       NaN

category       type1
variable           B
date
2000-01-31       NaN
2000-02-29       NaN
2000-03-31       NaN
2000-04-30 -1.113720
2000-05-31       NaN
2000-06-30       NaN
2000-07-31       NaN
2000-08-31       NaN
2000-09-30 -0.187762
2000-10-31 -0.474619

### Exercise:

In [ ]:
# HANDS ON:
# Consider a previous excercise few cells above:
# Creating a DataFrame with sales data
data = pd.DataFrame({
    'Region': ['North', 'South', 'East', 'West'],
    'Product_A': [100, 150, 200, 250],
    'Product_B': [120, 160, 220, 280],
    'Product_C': [130, 170, 240, 300]
})

# Set 'Region' column as index
data.set_index('Region', inplace=True)

# Displaying original data
print("Original Data:")
print(data)

#Use pivoting to get the the results shown in slide 27

Original Data:
        Product_A  Product_B  Product_C
Region
North         100        120        130
South         150        160        170
East          200        220        240
West          250        280        300

Stacked Data:
   Region    Product    0
0   North  Product_A  100
1   North  Product_B  120
2   North  Product_C  130
3   South  Product_A  150
4   South  Product_B  160
5   South  Product_C  170
6    East  Product_A  200
7    East  Product_B  220
8    East  Product_C  240
9    West  Product_A  250
10   West  Product_B  280
11   West  Product_C  300

Wide Format Data:
Product  Product_A  Product_B  Product_C
Region
East           200        220        240
North          100        120        130
South          150        160        170
West           250        280        300